app/controllers/job_applications_controller.rb

  def show
    @job_application = JobApplication.find(params[:id])
---
SELECT * FROM `job_applications` WHERE (`job_applications`.`id` = 1)

  def edit
    @job_application = JobApplication.find(params[:id])
---
SELECT * FROM `job_applications` WHERE (`job_applications`.`id` = 1)

  def create
    @job_application = JobApplication.new(params[:job_application])

    respond_to do |format|
      if @job_application.save
---
INSERT INTO `job_applications` (`dob`, `created_at`, `updated_at`, `last_name`, `first_name`, `email`) VALUES('2004-01-14', '2009-01-29 00:51:06', '2009-01-29 00:51:06', 'Bachman', 'Adam', 'adam.bachman@gmail.com')

  def update
    params[:job_application][:existing_address_attributes] ||= {}

    @job_application = JobApplication.find(params[:id])
---
SELECT * FROM `job_applications` WHERE (`job_applications`.`id` = 1)